<?php

namespace Drupal\court\Categorization;

/**
 * Class CourtRegion
 *
 * @package Drupal\reyestr_court\Categorization
 */
class CourtRegion implements CategorizationInterface {

  /**
   * {@inheritdoc}
   */
  public static function getList() {
    return [
      2 => 'Автономна Республіка Крим',
      3 => 'Вінницька область',
      4 => 'Волинська область',
      5 => 'Дніпропетровська область',
      6 => 'Донецька область',
      7 => 'Житомирська область',
      8 => 'Закарпатська область',
      9 => 'Запорізька область',
      10 => 'Івано-Франківська область',
      11 => 'Київська область',
      12 => 'Кіровоградська область',
      13 => 'Луганська область',
      14 => 'Львівська область',
      15 => 'Миколаївська область',
      16 => 'Одеська область',
      17 => 'Полтавська область',
      18 => 'Рівненська область',
      19 => 'Сумська область',
      20 => 'Тернопільська область',
      21 => 'Харківська область',
      22 => 'Херсонська область',
      23 => 'Хмельницька область',
      24 => 'Черкаська область',
      25 => 'Чернівецька область',
      26 => 'Чернігівська область',
      27 => 'м. Київ',
      28 => 'м. Севастополь',
      29 => 'ВС Центральний регіон',
      30 => 'ВС Західний регіон',
      31 => 'ВС Південний регіон',
      32 => 'ВС ВМС України',
    ];
  }

}